Revit 2027 API
Rebar.GetAllRebarShapeIds Method
 Gets the ids of the RebarShapes elements that defines the shapes of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAllRebarShapeIds()
Public Function GetAllRebarShapeIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetAllRebarShapeIds()
member GetAllRebarShapeIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 Returns the ids of the RebarShapes elements that defines the shapes of the rebar.
Remarks
 If multiple bars in the set has the same shape id, this id will be reported only one in the resulted array.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace